[
  {
    "id": 1,
    "image": "https://c.dns-shop.ru/thumb/st4/fit/800/650/3de3fddc4d615053fc2f818291ad9f8b/b68643884528c457b474944c056ffa2a94f13961954b25fd9d7117d3cb69b260.jpg",
    "diagonal": "5.8",
    "company": "Apple",
    "model": "iPhone Xs",
    "memory": "64",
    "color": "серый",
    "description": "Смартфон Apple iPhone Xs порадует вас высочайшей скоростью работы. 6-ядерный процессор A12 Bionic, частота которого равна впечатляющим 2.5 ГГц, работает в паре с 4 ГБ оперативной памяти. Полезным фактором для вас наверняка будет и объем встроенной памяти смартфона, равный 64 ГБ. Можно будет установить большое количество приложений.\nВажным преимуществом смартфона Apple iPhone Xs, которое наверняка оценят пользователи, ведущие активный образ жизни, является защищенность от воздействия пыли и влаги. Корпус модели соответствует степени защиты IP68: это очень впечатляющий показатель. В оснащение смартфона входит множество датчиков и модулей, в том числе – барометр, гироскоп, акселерометр и даже компас.\nСмартфон Apple iPhone Xs имеет стильный и одновременно строгий внешний вид: задняя часть корпуса модели окрашена в сдержанный темно-серый цвет. Для защиты данных используется сканер лица. Любителей качественного аудио порадует объемный стереозвук. Габаритные размеры корпуса смартфона составляют 70.9x143.6x7.7 мм. Масса модели равна 177 г.z",
    "common": {
      "year": 2018
    },
    "mobileConnection": {
      "lteSupport": true
    }
  },
  {
    "id": 2,
    "image": "https://c.dns-shop.ru/thumb/st1/fit/800/650/eb27c2cf4a8fc8f62f2ae8e6ef6fd005/962f4f6cb65f70fedf5dc2803d1e2ad38d82114232690978f9a5993c50d19247.png",
    "diagonal": "4",
    "company": "DEXP",
    "model": "A140",
    "memory": "8",
    "color": "черный",
    "description": "Смартфон DEXP A140 обладает возможностью установки двух SIM-карт, что позволит вам использовать одновременно и рабочий, и основной номера. Еще одно достоинство устройства – наличие 4-дюймового экрана, на который выводится невероятно четкая и яркая картинка.\nЗа возможность работы с несколькими ресурсоемкими приложениями в модели DEXP A140 отвечает 4-ядерный процессор и 512 МБ оперативной памяти. Для хранений необходимых вам файлов в данном смартфоне предусмотрено 8 ГБ внутренней памяти с возможностью последующего расширения.",
    "common": {
      "year": 2018
    },
    "mobileConnection": {
      "lteSupport": false
    }
  }
]